# --- Brew formulae

# CLI
brew "jq"
brew "yq"
brew "tree"
brew "git"
brew "gh"
brew "cloc"
brew "bash"
brew "yamllint"

# --- Brew casks

# Communication
cask "deskpad"
cask "discord"
cask "telegram"
cask "whatsapp"

# Development
cask "docker-desktop"
cask "ghostty"
cask "visual-studio-code"

# Fonts
cask "font-monaspace"

# Entertainment
cask "spotify"
cask "crossover"
cask "vlc"

# Productivity
cask "caffeine"
cask "logi-options+"
cask "raycast"
cask "tailscale-app"
cask "keyboard-maestro"

# Web Browsers
cask "google-chrome"
