# --- Brew formulae

# CLI
brew "jq"
brew "yq"
brew "tree"
brew "git"
brew "gh"
brew "cloc"
brew "bash"
brew "yamllint"

# --- Brew casks

# Communication
cask "discord"
cask "whatsapp"

# Development
cask "docker-desktop"
cask "ghostty"
cask "intellij-idea"

# Fonts
cask "font-monaspace"

# Entertainment
cask "spotify"
cask "crossover"

# Productivity
cask "caffeine"
cask "raycast"

# Web Browsers
cask "google-chrome"
